{
  "HomePage": {
    "title": "Hola, soy Philip – ¡Desarrollador Frontend en React!",
    "subtitle": "👨‍💻 Me especializo en crear aplicaciones web modernas y fáciles de usar con React, TypeScript y tecnologías de vanguardia. 🌟 Mi enfoque está en ofrecer experiencias de usuario fluidas y en desarrollar código escalable y mantenible para proyectos dinámicos. 🔧✨",
    "reachAt": "No dudes en contactarme en",
    "aboutMeBtn": "Más sobre mí",
    "resumeBtn": "Descargar currículum",
    "resumeBtnDownloading": "Descargando...",
    "myStack": "Mi stack tecnológico preferido",
    "nav": {
      "home": "Inicio",
      "projects": "Proyectos",
      "about": "Sobre mí",
      "technologies": "Tecnologías"
    },
    "command": {
      "general": "General",
      "copy": "Copiar enlace",
      "copySuccess": "¡Copiado!",
      "copySuccessMessage": "Enlace copiado al portapapeles.",
      "copyFail": "¡Error!",
      "copyFailMessage": "API del portapapeles no soportada.",
      "sourceCode": "Código fuente",
      "downloadResume": "Descargar currículum",
      "projects": "Proyectos",
      "socials": "Redes sociales",
      "invoiceHub": "InvoiceHub",
      "positivus": "Positivus",
      "reactHooksExplorer": "Explorador de React Hooks",
      "georgianTravelguide": "Guía de viajes de Georgia",
      "georgianTechnicalUniversity": "Universidad Técnica de Georgia",
      "github": "Github",
      "linkedin": "LinkedIn",
      "discord": "Discord"
    }
  },
  "AboutMe": {
    "title": "Sobre mí",
    "subtitle": "👋 ¡Hola! Soy Philip, un apasionado del desarrollo web.",
    "moreInfo": "Más información",
    "checkStack": "Mira mi stack",
    "description": {
      "aboutOne": "Soy un apasionado desarrollador Front-End de React 🚀 con experiencia en la creación de sistemas de gestión sofisticados y aplicaciones web. Con una sólida base en tecnologías web modernas ⚙️ y atención a los detalles, me especializo en crear interfaces de usuario intuitivas que mejoran las operaciones empresariales.",
      "aboutTwo": "Lo que me diferencia es mi compromiso con la entrega de código de alta calidad 🏆 y mi capacidad para traducir requisitos empresariales complejos en soluciones elegantes. Disfruto trabajar en entornos colaborativos 🤝 y constantemente recibo elogios por mi comunicación clara y habilidades para resolver problemas.",
      "presence": "Mantengo una presencia activa en",
      "host": "Donde alojo mis proyectos y contribuyo a la comunidad de desarrolladores 🌐."
    },
    "challenges": {
      "coding": "Retos de codificación",
      "codewars": "De vez en cuando, mejoro mis habilidades de resolución de problemas en Codewars: "
    },
    "currentProject": {
      "title": "Proyecto actual: ",
      "description": "⚙️ Actualmente estoy desarrollando InvoiceHub, mi primer proyecto SaaS, lo cual ha sido un viaje increíble implementando las mejores prácticas a nivel empresarial. Este proyecto demuestra mi experiencia en:",
      "architecture": "Arquitectura limpia y principios SOLID 🤝",
      "state": "Gestión de estado escalable 🌱",
      "performance": "Optimización del rendimiento",
      "security": "Mejores prácticas de seguridad 🔒",
      "pipelines": "Pipelines CI/CD completos con GitHub Actions 🔁",
      "design": "Diseño responsivo para varios dispositivos 📱",
      "focus": "Actualmente, me estoy enfocando en implementar estrategias avanzadas de almacenamiento en caché ⚡ para mejorar la recuperación de datos, resultando en un mejor rendimiento y experiencia de usuario.",
      "viewBtn": "Ver InvoiceHub"
    },
    "learning": {
      "title": "Enfoque de aprendizaje actual",
      "subtitle": "Actualmente estoy profundizando mis conocimientos en",
      "description": "y dominando patrones de diseño de bases de datos relacionales. Este enfoque continuo de aprendizaje asegura que me mantenga a la vanguardia en prácticas de desarrollo web."
    }
  },
  "Projects": {
    "title": "Proyectos",
    "subtitle": "La lista de mis proyectos. Todo fue hecho con ❤️.",
    "visitSite": "Visitar sitio web",
    "seeAll": "Ver todos los proyectos",
    "invoicehub": "InvoiceHub es una plataforma integral diseñada para simplificar la gestión de facturas, productos, clientes y usuarios. Con una interfaz moderna, rápida y fácil de usar, InvoiceHub ofrece una experiencia excepcional impulsada por gráficos interactivos y herramientas avanzadas basadas en inteligencia artificial.",
    "positivus": "Este es un proyecto de front-end totalmente responsivo e interactivo construido con React y Tailwind CSS. Cuenta con un diseño moderno y elegante, con el objetivo de proporcionar una experiencia excepcional en todos los dispositivos. El proyecto está basado en el diseño de la página de aterrizaje de Positivus en Figma.",
    "reacthooks": "React Hooks Explorer – un proyecto interactivo diseñado para ayudar a los desarrolladores a dominar los hooks más usados en React mediante práctica práctica. Ya sea que estés aprendiendo, repasando tus conocimientos o preparándote para entrevistas, este proyecto ofrece descripciones, ejemplos, ejercicios y preguntas de entrevistas para cada hook, todo en un solo lugar.",
    "travelguide": "Guía de Viajes de Georgia, proporciona a los usuarios información sobre los lugares más interesantes y notables de Georgia de la manera más conveniente, lo que ayudará a los usuarios a seleccionar las rutas óptimas y planificar los tours de manera efectiva.",
    "gtu": "La Universidad Técnica de Georgia (GTU, anteriormente Instituto Politécnico Georgiano V.I. Lenin) es la universidad técnica principal y más grande de Georgia. Está ubicada en la ciudad capital de Tiflis."
  },
  "Greetings": {
    "title": "¡Hola, soy Philip – Desarrollador Frontend en React!"
  }
}
