{
  "HomePage": {
    "title": "გამარჯობა, მე ვარ ფილიპი – React-ის ფრონტენდ დეველოპერი!",
    "subtitle": "👨‍💻 მე სპეციალიზირებული ვარ თანამედროვე, მოსახერხებელი ვებ-აპლიკაციების შექმნაზე React-ის, TypeScript-ისა და მოწინავე ტექნოლოგიების გამოყენებით. 🌟 ჩემი ყურადღება გამახვილებულია მომხმარებლის შეუფერხებელი გამოცდილების შექმნაზე და დინამიური პროექტებისთვის მასშტაბირებადი და მარტივად მოსავლელი კოდის მიწოდებაზე. 🔧✨",
    "reachAt": "მომმართეთ ნებისმიერ დროს",
    "aboutMeBtn": "მეტი ჩემს შესახებ",
    "resumeBtn": "რეზიუმეს ჩამოტვირთვა",
    "resumeBtnDownloading": "ჩამოტვირთვა...",
    "myStack": "ჩემი საყვარელი ტექნოლოგიური სტეკი"
  },
  "AboutMe": {
    "title": "ჩემ შესახებ",
    "subtitle": "👋 გამარჯობა! მე ვარ ფილიპი, ვებ-დეველოპმენტის მოყვარული ადამიანი.",
    "moreInfo": "დამატებითი ინფორმაცია",
    "checkStack": "გაიცანით ჩემი სტეკი",
    "description": {
      "aboutOne": "მე ვარ React-ის ფრონტენდ დეველოპერი 🚀, რომელსაც აქვს გამოცდილება რთული მართვის სისტემებისა და ვებ-აპლიკაციების შექმნაში. თანამედროვე ვებ-ტექნოლოგიების ძლიერი საფუძველით ⚙️ და დეტალებზე ყურადღების გამახვილებით, მე სპეციალიზირებული ვარ ინტუიციური მომხმარებლის ინტერფეისების შექმნაზე, რომლებიც აუმჯობესებს ბიზნესის პროცესებს.",
      "aboutTwo": "ჩემი მთავარი უნარია მაღალი ხარისხის კოდის მიწოდება 🏆 და რთული ბიზნეს მოთხოვნების ელეგანტურ გადაწყვეტილებებად გარდაქმნა. მე ვმუშაობ გუნდურ გარემოში 🤝 და ხშირად მივიღებ პოზიტიურ შეფასებას ჩემი კომუნიკაციისა და პრობლემების გადაჭრის უნარებისთვის.",
      "presence": "მე აქტიურად ვმონაწილეობ",
      "host": "სადაც ვმასპინძლობ ჩემს პროექტებს და ვმონაწილეობ დეველოპერების საზოგადოებაში 🌐."
    },
    "challenges": {
      "coding": "კოდის გამოწვევები",
      "codewars": "დროდადრო ვაუმჯობესებ პრობლემების გადაჭრის უნარებს Codewars-ზე: "
    },
    "currentProject": {
      "title": "ამჟამინდელი პროექტი: ",
      "description": "⚙️ ახლა ვმუშაობ InvoiceHub-ზე, ჩემს პირველ SaaS პროექტზე, რაც იყო საოცარი მოგზაურობა საწარმოს დონის საუკეთესო პრაქტიკის განხორციელებაში. ეს პროექტი აჩვენებს ჩემს გამოცდილებას შემდეგში:",
      "architecture": "სუფთა არქიტექტურა და SOLID პრინციპები 🤝",
      "state": "მასშტაბირებადი მდგომარეობის მართვა 🌱",
      "performance": "შესრულების ოპტიმიზაცია",
      "security": "უსაფრთხოების საუკეთესო პრაქტიკები 🔒",
      "pipelines": "სრული CI/CD პაიპლაინები GitHub Actions-ით 🔁",
      "design": "მრავალ მოწყობილობაზე პასუხისმგებელი დიზაინი 📱",
      "focus": "ამჟამად, ვამუშავებ მონაცემთა მიღების გაუმჯობესებისთვის სწრაფი ქეშირების სტრატეგიებს ⚡, რაც აუმჯობესებს მუშაობასა და მომხმარებლის გამოცდილებას.",
      "viewBtn": "ნახეთ InvoiceHub"
    },
    "learning": {
      "title": "ამჟამინდელი სასწავლო ფოკუსი",
      "subtitle": "ამჟამად ვამაღლებ ჩემს ცოდნას",
      "description": "და ვფლობ რელაციური მონაცემთა ბაზების დიზაინის შაბლონებს. ეს უწყვეტი სწავლების მიდგომა უზრუნველყოფს, რომ ვრჩები ვებ-დეველოპმენტის პრაქტიკის წინა ხაზზე."
    }
  },
  "Projects": {
    "title": "პროექტები",
    "subtitle": "ჩემი პროექტების სია. ყველაფერი შექმნილია ❤️.",
    "visitSite": "საიტის მონახულება",
    "seeAll": "ყველა პროექტი",
    "invoicehub": "InvoiceHub არის ყოვლისმომცველი პლატფორმა, რომელიც გამარტივებულია ინვოისების, პროდუქტების, კლიენტების და მომხმარებლების მართვისთვის. თანამედროვე, სწრაფი და მოსახერხებელი ინტერფეისით, InvoiceHub გთავაზობთ გამორჩეულ გამოცდილებას, რომელსაც მხარს უჭერს ინტერაქტიული დიაგრამები და მოწინავე AI ინსტრუმენტები.",
    "positivus": "ეს არის სრულად საპასუხო და ინტერაქტიული ფრონტ-ენდ პროექტი, შექმნილი React-ით და Tailwind CSS-ით. მას აქვს თანამედროვე და ელეგანტური დიზაინი, რომელიც მიზნად ისახავს გამორჩეულ მომხმარებლის გამოცდილებას ყველა მოწყობილობაზე. პროექტი დაფუძნებულია Figma-ზე Positivus-ის სადესანტო გვერდის დიზაინზე.",
    "reacthooks": "React Hooks Explorer – ინტერაქტიული პროექტი, რომელიც ეხმარება დეველოპერებს ყველაზე ხშირად გამოყენებული React-ის ჰუკების ათვისებაში პრაქტიკული სავარჯიშოების საშუალებით. იქნება ეს სწავლა, ცოდნის განახლება თუ ინტერვიუსთვის მზადება, ეს პროექტი მოიცავს აღწერებს, მაგალითებს, სავარჯიშოებს და ინტერვიუს კითხვებს თითოეული ჰუკისთვის ერთ ადგილას.",
    "travelguide": "GeorgianTravelGuide, მომხმარებელს აწვდის ინფორმაციას საქართველოს ყველაზე საინტერესო და საყურადღებო ადგილების შესახებ ყველაზე მოსახერხებელი გზით, რაც დაეხმარება მომხმარებელს ოპტიმალური მარშრუტების შერჩევასა და ტურების ეფექტურად დაგეგმვაში.",
    "gtu": "საქართველოს ტექნიკური უნივერსიტეტი (GTU, ყოფილი ვ.ი. ლენინის საქართველოს პოლიტექნიკური ინსტიტუტი) არის საქართველოს მთავარი და უდიდესი ტექნიკური უნივერსიტეტი. იგი მდებარეობს ქვეყნის დედაქალაქ თბილისში."
  },
  "Greetings": {
    "title": "გამარჯობა, მე ვარ ფილიპი – React-ის ფრონტენდ დეველოპერი!"
  }
}
